//index.js
//获取应用实例
const app = getApp();

Page({
   data:{
     mass:"《鸿基资盈宝用户使用协议》",
     text:'尊敬的鸿基资盈宝用户：鸿基资盈宝平台或鸿基资盈宝www.xxxxxx.com（XXXXX有限公司及其关联公司，以下亦称“我们”）非常重视客户个人信息及隐私权的保护，因此我们制订了涵盖如何收集、存储、使用、共享和保护客户信息的隐私政策。请仔细阅读本《鸿基资盈宝页用户使用协议》（“用户协议”）的全部条款，确认您已完全了解我们对您个人信息的处理规则，并作出您认为适当的选择。阅读过程中，如您有任何疑问，可联系我们的客服（电话010-10106188）咨询，如您不同意协议中的任何条款，您应立即停止访问鸿基资盈宝平台。',
     contents:"您使用或在我们更新本隐私政策后（我们会及时提示您更新的情况）继续使用我们的产品和/或服务，即意味着您同意本隐私政策(含更新版本)内容，并且同意我们按照本隐私政策收集、使用、保存和共享您的相关信息。",
     list:'一、信息的收集和使用',
     jw:"个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。为本隐私政策之目的，个人信息包括：基本信息（包括个人姓名、生日、性别、住址、个人电话号码、电子邮箱）；个人身份信息（包括身份证、军官证、护照、驾驶证等）；面部特征；网络身份标识信息（包括电子签名、系统账号、IP地址、邮箱地址及与前述有关的密码、口令、口令保护答案）；个人财产信息（房产信息、房源交易信息、房源租赁信息、交易记录、交易账户、链家币等虚拟财产信息）；网络身份识别信息（包括账户名、账户昵称、邮箱地址及与前述有关的密码与密码保护问题和答案）；其他信息（包括通讯录、个人电话号码、手机号码、行程信息、网页浏览记录、住宿信息、精准定位信息）。"

   }
})
