// pages/asking_for_details/asking_for_details.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    background:[{
      arrty:[{
        ask: '答',
        ask_inner: '我买的黄橙色，很有质感很喜欢，是我喜欢的款，纯属个人看法。',
        ask_down: '林夕 2018-09-15 12:54:20'
      }, {
        ask: '答',
        ask_inner: '我买的黄橙色，很有质感很喜欢，是我喜欢的款，纯属个人看法。',
        ask_down: '林夕 2018-09-15 12:54:20'
        }, {
          ask: '答',
          ask_inner: '我买的黄橙色，很有质感很喜欢，是我喜欢的款，纯属个人看法。',
          ask_down: '林夕 2018-09-15 12:54:20'
      }, {
        ask: '答',
        ask_inner: '我买的黄橙色，很有质感很喜欢，是我喜欢的款，纯属个人看法。',
        ask_down: '林夕 2018-09-15 12:54:20'
        }, {
          ask: '答',
          ask_inner: '我买的黄橙色，很有质感很喜欢，是我喜欢的款，纯属个人看法。',
          ask_down: '林夕 2018-09-15 12:54:20'
      }, {
        ask: '答',
        ask_inner: '我买的黄橙色，很有质感很喜欢，是我喜欢的款，纯属个人看法。',
        ask_down: '林夕 2018-09-15 12:54:20'
      }],
    
    }, {
        arrty: [{
          ask: '答',
          ask_inner: '我买的黄橙色，很有质感很喜欢，是我喜欢的款，纯属个人看法。',
          ask_down: '林夕 2018-09-15 12:54:20'
        }, {
          ask: '答',
          ask_inner: '我买的黄橙色，很有质感很喜欢，是我喜欢的款，纯属个人看法。',
          ask_down: '林夕 2018-09-15 12:54:20'
        }, {
          ask: '答',
          ask_inner: '我买的黄橙色，很有质感很喜欢，是我喜欢的款，纯属个人看法。',
          ask_down: '林夕 2018-09-15 12:54:20'
        }, {
          ask: '答',
          ask_inner: '我买的黄橙色，很有质感很喜欢，是我喜欢的款，纯属个人看法。',
          ask_down: '林夕 2018-09-15 12:54:20'
        }, {
          ask: '答',
          ask_inner: '我买的黄橙色，很有质感很喜欢，是我喜欢的款，纯属个人看法。',
          ask_down: '林夕 2018-09-15 12:54:20'
        }, {
          ask: '答',
          ask_inner: '我买的黄橙色，很有质感很喜欢，是我喜欢的款，纯属个人看法。',
          ask_down: '林夕 2018-09-15 12:54:20'
        }],

      }, {
        arrty: [{
          ask: '答',
          ask_inner: '我买的黄橙色，很有质感很喜欢，是我喜欢的款，纯属个人看法。',
          ask_down: '林夕 2018-09-15 12:54:20'
        }, {
          ask: '答',
          ask_inner: '我买的黄橙色，很有质感很喜欢，是我喜欢的款，纯属个人看法。',
          ask_down: '林夕 2018-09-15 12:54:20'
        }, {
          ask: '答',
          ask_inner: '我买的黄橙色，很有质感很喜欢，是我喜欢的款，纯属个人看法。',
          ask_down: '林夕 2018-09-15 12:54:20'
        }, {
          ask: '答',
          ask_inner: '我买的黄橙色，很有质感很喜欢，是我喜欢的款，纯属个人看法。',
          ask_down: '林夕 2018-09-15 12:54:20'
        }, {
          ask: '答',
          ask_inner: '我买的黄橙色，很有质感很喜欢，是我喜欢的款，纯属个人看法。',
          ask_down: '林夕 2018-09-15 12:54:20'
        }, {
          ask: '答',
          ask_inner: '我买的黄橙色，很有质感很喜欢，是我喜欢的款，纯属个人看法。',
          ask_down: '林夕 2018-09-15 12:54:20'
        }],
    }, {
      arrty: [{
        ask: '答',
        ask_inner: '我买的黄橙色，很有质感很喜欢，是我喜欢的款，纯属个人看法。',
        ask_down: '林夕 2018-09-15 12:54:20'
      }, {
        ask: '答',
        ask_inner: '我买的黄橙色，很有质感很喜欢，是我喜欢的款，纯属个人看法。',
        ask_down: '林夕 2018-09-15 12:54:20'
      }, {
        ask: '答',
        ask_inner: '我买的黄橙色，很有质感很喜欢，是我喜欢的款，纯属个人看法。',
        ask_down: '林夕 2018-09-15 12:54:20'
      }, {
        ask: '答',
        ask_inner: '我买的黄橙色，很有质感很喜欢，是我喜欢的款，纯属个人看法。',
        ask_down: '林夕 2018-09-15 12:54:20'
      }, {
        ask: '答',
        ask_inner: '我买的黄橙色，很有质感很喜欢，是我喜欢的款，纯属个人看法。',
        ask_down: '林夕 2018-09-15 12:54:20'
      }, {
        ask: '答',
        ask_inner: '我买的黄橙色，很有质感很喜欢，是我喜欢的款，纯属个人看法。',
        ask_down: '林夕 2018-09-15 12:54:20'
      }],
    }],
    ask:'什么颜色好看？',
    indicatorDots: false,
    vertical: false,
    autoplay: false,
    circular: false,
    interval: 2000,
    duration: 500,
    previousMargin:30,
    nextMargin:30
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})